Лабораторна робота №7. Функції 

Розробник 
 - Кайдаш Ярослав Андрійович 
 - студент групи КІТ-121д 
 - 23-грудня-2021

Завдання: Переробити програми, що були розроблені під час виконання лабораторних робіт з тем “Масиви” та “Цикли” таким чином,
		 щоб використовувалися функції для обчислення результату.

Основна частина:
- опис роботи основної циклічної конструкції :  використання фунцій  для знаходження квадрату заданої матриці .

- перелік вхідних даних:
	- size - розмір квадратної матриці (int);
      - Nod - НСД двох чисел (л/р 5)
	-n- ступінь матриці 
	-x ,y- числа , для яких визначають НСД
	-c[] , a[]- масиви (матриці)
	-new_mat[size][size]- нова матриця (використовується при розрахунку визначника матриці)
	-det - визначник матриці
	- others - лічільники 

   - для підтвердження коректності роботи програми, зупинено відлагодник на строці 145  та введемо команду "v".
   -Та отримаємо результат :
			b 145
Breakpoint 1: where = main.bin`main + 708 at main.c:146:1, address = 0x00000000004017e4
(lldb) r
Process 9263 launched: '/home/jorik/sample_project/lab07/dist/main.bin' (x86_64)
Process 9263 stopped
* thread #1, name = 'main.bin', stop reason = breakpoint 1.1
    frame #0: 0x00000000004017e4 main.bin`main at main.c:146:1
   143 			}
   144 	
   145 	
-> 146 	return 0;
   147 	}
(lldb) v
(int) Nod = 1
(int) y = 9383
(int) x = 1
(const int) m = 4
(int) i = 4
(int) j = 4
(int) n = 2
(int) k = 4
(int) t1 = 3
(int) t2 = 3
(int [16]) a = {
  [0] = 2
  [1] = 2
  [2] = 8
  [3] = 9
  [4] = 7
  [5] = 3
  [6] = 6
  [7] = 1
  [8] = 2
  [9] = 9
  [10] = 3
  [11] = 1
  [12] = 9
  [13] = 4
  [14] = 7
  [15] = 8
}
(int [16]) c = {
  [0] = 115
  [1] = 118
  [2] = 115
  [3] = 100
  [4] = 128
  [5] = 115
  [6] = 127
  [7] = 81
  [8] = 160
  [9] = 121
  [10] = 151
  [11] = 105
  [12] = 138
  [13] = 79
  [14] = 127
  [15] = 99
}
(int [3][3]) matrix = {
  [0] = ([0] = 17, [1] = 29, [2] = 32)
  [1] = ([0] = 30, [1] = 12, [2] = 23)
  [2] = ([0] = 17, [1] = 35, [2] = 29)
}
(int [9]) row_matrix = ([0] = 17, [1] = 29, [2] = 32, [3] = 30, [4] = 12, [5] = 23, [6] = 17, [7] = 35, [8] = 29)
(int) det = 5412


   Як бачимо, результат співпав. 
    Подібність результатів говорить про те, що програма працює коректно.

Структура проекту лабораторної роботи:

.
├── dist
│   ├── html
│   │
│   └── main.bin
├── doc
│   └── New Empty File
├── Doxyfile
├── Makefile
├── README.md
└── src
    └── main.c




Висновки: при виконанні лабораторної роботи буди набуті практичні навички створення програм, що мають функції , на мові С.
