/**
 * @mainpage
 * # Загальне завдання
 * Дано двовимірний масив з 𝑁 × 𝑁 цілих чисел. Помножити матрицю саму на себе
 *(відповідно до правил множення матриць).
 *
 *
 * @author Kaydash
 * @date 13-dec-2021
 */

/**
 * Головна функція.
 *
 * Послідовність дій:
 * - створення змінних m , i,j,k,a[m][m],c[m][m]
 * - надання змінній (m) певних значень
 * - Використовуючи  два вкладених цикла  for  знаходимо квадрат заданої матриці .
 */
#include <stdio.h>
#include <stdlib.h>
#include<math.h>
 
int main() {
    const int m = 2;
    int i, j,  k = 0 , n = 2;
	 int a[m][m], c[m][m];
   
  	
    for (i = 0; i < m; i++) {
        for (j = 0; j < m; j++) {
            a[i][j] = i + 1 + j ;
		c[i][j] = 0;
        }
    }
 
	 

for(i = 0; i < m; i++)
  {  for(j = 0; j < m; j++)
    {
        for(k = 0; k < m; k++)
        c[i][j] = c[i][j] + (a[i][k] * a[k][j]);
    }
}
 
 
    return 0;
}

